# CH3A - Activity 1

In [22]:
import numpy as np
import pandas as pd

In [3]:
x1 = pd.Series([2,4,6])
x1

0    2
1    4
2    6
dtype: int64

In [4]:
x2 = pd.Series(5, index=[100, 200, 300])
x2

100    5
200    5
300    5
dtype: int64

In [ ]:
x3 = pd.Series({2:'a', 1:'b', 3:'c'})
x3

# CH3A - Activity 2

In [5]:
pd.DataFrame(np.random.rand(3, 2),
             columns=['foo', 'bar'],
             index=['a', 'b', 'c'])

        foo       bar
a  0.948708  0.775970
b  0.091423  0.077716
c  0.695298  0.458411

# CH3B - Activity 1

In [12]:
x = np.random.randint(0,10,size=(3,2))
df = pd.DataFrame(x,columns=list('AB'))
df

   A  B
0  1  8
1  8  2
2  5  6

In [14]:
print(df.mean(axis=1))
print(df.stack().mean())

0    4.5
1    5.0
2    5.5
dtype: float64
5.0

# CH3B - Activity 1

In [17]:
df = pd.DataFrame([[1, np.nan, 2],
                   [2, 3, 5],
                   [np.nan, 4, 6]],columns=list('ABC'))
df

     A    B  C
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [18]:
df['D']=[np.nan]*3
df

     A    B  C   D
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [20]:
df.fillna(method='ffill',axis=1)

     A    B    C    D
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

# CH3C - Activity 1

In [24]:
ind   = pd.MultiIndex.from_product([[2010, 2014], ['summer', 'winter']])
col   = pd.MultiIndex.from_product([['asia', 'europe'], ['East', 'West']],
                                     names=['Area', 'Region'])
df = pd.DataFrame(np.random.randint(low=0,high=10,size=(4,4)),index=ind,columns=col)
df.index.names = ['year', 'season']
df

Area        asia      europe
Region      East West   East West
year season
2010 summer    9    7      3    1
     winter    4    3      6    7
2014 summer    5    2      1    4
     winter    4    3      1    4

# CH3C - Activity 2

In [25]:
df.mean(axis=0)

Area    Region
asia    East      5.50
        West      3.75
europe  East      2.75
        West      4.00
dtype: float64

In [26]:
df_mean = df.mean(level='year')
df_mean

Area   asia      europe
Region East West   East West
year
2010    6.5  5.0    4.5  4.0
2014    4.5  2.5    1.0  4.0

In [27]:
df_mean.mean(axis=1,level='Area')

Area  asia  europe
year
2010  5.75    4.25
2014  3.50    2.50

# CH3D - Activity 1

In [12]:
d1 = {'Customer_id':pd.Series([1,2,3,4,5,6]),
      'Product':pd.Series(['Oven','Oven','Oven','Television','Television','Television'])}
df1 = pd.DataFrame(d1)
df1

   Customer_id     Product
0            1        Oven
1            2        Oven
2            3        Oven
3            4  Television
4            5  Television
5            6  Television

In [13]:
d2 = {'Customer_id':pd.Series([2,4,6]),
    'State':pd.Series(['California','California','Texas'])}
df2 = pd.DataFrame(d2)
df2

   Customer_id       State
0            2  California
1            4  California
2            6       Texas

In [14]:
pd.merge(df1, df2, on='Customer_id', how='inner')

   Customer_id     Product       State
0            2        Oven  California
1            4  Television  California
2            6  Television       Texas

In [15]:
pd.merge(df1, df2, on='Customer_id', how='outer')

   Customer_id     Product       State
0            1        Oven         NaN
1            2        Oven  California
2            3        Oven         NaN
3            4  Television  California
4            5  Television         NaN
5            6  Television       Texas

In [16]:
pd.merge(df1, df2, on='Customer_id', how='left')

   Customer_id     Product       State
0            1        Oven         NaN
1            2        Oven  California
2            3        Oven         NaN
3            4  Television  California
4            5  Television         NaN
5            6  Television       Texas

In [ ]:
pd.merge(df1, df2, on='Customer_id', how='right')

# CH3E - Activity 1

In [2]:
import numpy as np
import pandas as pd

rng = np.random.RandomState(0)
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data1': range(6),
                   'data2': rng.randint(0, 10, 6)},
                  columns = ['key', 'data1', 'data2'])
df.head()

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7

In [3]:
df.groupby('key').min()

     data1  data2
key
A        0      3
B        1      0
C        2      3

In [4]:
df.groupby('key').max()

     data1  data2
key
A        3      5
B        4      7
C        5      9

In [5]:
df.groupby('key').mean()

     data1  data2
key
A      1.5    4.0
B      2.5    3.5
C      3.5    6.0

# CH3F- Activity 1

In [ ]:
!curl -O https://raw.githubusercontent.com/jakevdp/data-CDCbirths/master/births.csv
    
births = pd.read_csv('births.csv')
births.head()

In [ ]:
births['decade'] = 10 * (births['year'] // 10)
births.pivot_table('births', index='decade', columns='gender', aggfunc='sum')